# BuiltInFailures.RevolutionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevolutionFailures Class
BuiltInFailures Class Members See Also
---
Failures about Revolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RevolutionFailures
```

Visual Basic
---
```text
Public NotInheritable Class RevolutionFailures
```

Visual C++
---
```text
public ref class RevolutionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RevolutionFailures
# See Also
BuiltInFailures..::..RevolutionFailures Members
Autodesk.Revit.DB Namespace